---
type: IFCAggregate
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 11
tags: [revit-api, class]
---

# IFCAggregate

`Autodesk.Revit.DB.IFC.IFCAggregate` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Add | 2013 | `public void Add ( IFCData ifcData )` |
| Method | AddAggregate | 2013 | `public IFCAggregate AddAggregate ()` |
| Method | AddValueOfType | 2023 | `public void AddValueOfType ( string typeName )` |
| Method | Delete | 2013 | `public void Delete ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator < IFCData > GetEnumerator ()` |
| Method | GetIFCAggregateIterator | 2013 | `public IFCAggregateIterator GetIFCAggregateIterator ()` |
| Property | Count | 2013 | `public int Count { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Item | — | `public IFCData this [ int index ] { get ; }` |